# dictionary славарь
# dict = { "name": "dastan","surname":"ashyraliev","age":25}
# for i in range(3):
#      a = input("Enter a name: ")
#      if a == dict["name"]:
#          print("you guessed")
#          break
#      else:
#          print("Not found")
from ftplib import parse227

# dictionary = {"число":"number","имя":"name","рост":"height"}
# p1 = print("1 пункт перевод слова ")
# p2 = print("2 пункт дабавит слово ")
# p3 = print("3 пункт выхот")
# while True:
#     a = input("вветиде слова")
#     if a == "1 пункт":
#         b = input("введите слов")
#         if b in dictionary:
#             print("перевод слова",[dictionary[b]])
#         else:
#             print("Такого слова нет в словаре")
#     elif a == "2 пункт":
#         c = input("введите новое слова")
#         d = input("Какие слова вы добавляете?")
#         dictionary[c] = d
#         print("слова довбавлен")
#     elif a == "3 пункт":
#         print("выход из перевотчика")
#         break
#     else:
#         print("завершина")

# dict = {"пн":"21 градус","вт":"20 градус","ср":"16 градус","чт":"22градус","пт":"23 градус"}
# p1=["1  покозать всю погода  "]
# p2=["2  покозать жаркий день"]
# p3=["3  добовить  день и температура "]
# p4=["4  выхот "]
# while True:
#     a = input("какой пункт нужен")
#     if a == "1 ":
#         print("всё погода",dict)
#     elif a =="2 пункт":
#         print("Это самый жаркий день недели пт : 23 градус")
#     elif a =="3 ":
#         b = input("введите день")
#         c = input("вветиде температура")
#         dict[b] = c
#         print("Добавлен новый день")
#     elif a == "4 ":
#         print("выход")
#         break
#     else:
#         print("попробуйте")

# dict = {"яблоко": "10","кола": "100","молоко": "40","морожные": "35"}
# while True:
#     print("меню магазина")
#     print("1 - показать продукты")
#     print("2 - добавить товар в корзину")
#     print("3 - удалить товар из корзины")
#     print("4 - показать корзину")
#     print("5 - выход")
#     a = input(" выберите вариант:")
#     if a == "1":
#         print("меню магазин", dict)
#     elif a == "2":
#         b = input("введите продукт: ")
#         q = input(" введите количество: ")
#         dict[b] = q
#         print( "добавлено в корзину")
#     elif a == "3":
#         n = input(" введите продукт для удаления:")
#         dict[n] = "0"
#         print(n, "удалено из корзины")
#     elif a == "4":
#         print("Содержимое корзины:")
#         print("яблоко -", dict["яблоко"])
#         print("кола-", dict["кола"])
#         print("молоко -", dict["молоко"])
#         print("морожные -", dict["морожные"])
#     elif a == "5":
#         print("выход")
#         break
#     else:
#         print("завершон")

# dict = {"алма":75,"нан":25,"айран":100}
# p1 = print(["1 покозот меню"])
# p2 = print(["2 вверите дейтвия"])
# p3 = print(["3 купит продукта "])
# p4 = print(["4 выход"])
# while True:
#     a = input("что вы хотите?")
#     print(dict[a])

# a = {}
# b = 0
# c = 0
# while True:
#         d = ("")







        
# задание
#
# создание электронный дневник
#
# в ней пользователь может  добавить учеников и их оценки
# изменить данные и смотреть средний балл каждого ученика
#
#
# первый пункт добавить ученика
# 2 пункт добавить оценку ученика
# 3 показать все оценки
# 4 показать балл ученика
# 5  выход
#
#
# доавбить имя ученика
# и после доабавление показать имя добавленного ученика и написать что данный ученик добавлен
#
# 2 пункт ввести имя ученика и дать ему оценку от 1 до 5
# и написать что оценка данному ученику добавлен
# при ошибке напистаь что такой оценки нет
# и еще если нет такого ученика написать что нет токого ученика
#
#
# 3 пункт список учеников и их оценки
#
# 4 пункт
#
# средний балл ученика если ученик больше 4 балла тогда отличник
# если меньше 4  написать что надо потянуть оценки
# при любой другой ситуации написать что нет данных данного ученика и не оценки
#
# 5 выход из программы  если и написать логику ошибка при выходе из программы должно быть написано
# ошибка выберите 1 от 5 действии в программе

# dict = {}
# while True:
#     print("1 пункт добавить ученика")
#     print("2 пункт добавить оценку ученика")
#     print("3 показать все оценки")
#     print("4 показать балл ученика")
#     print("5  выход")
#     a = input("какой пункт нужен")
#     if a == "1":
#         b = input("добавить имя ученика")
#         print("учевник добавил")
#     elif a =="2":
#         c = input("добавить оценку ученика")
#         dict[b] = c
#         print("оценка добавил")
#     elif a =="3":
#             print(dict)
#     elif a =="4":
#         for h in dict:
#               f = dict
#               if  f == 5:
#                   print("отличник",f)
#               elif f == 4:
#                   print("ударник",f)
#               elif f == 3:
#                   print("тройшник",f)
#               else:
#                  print("такой оценки нет")
#     elif a =="5":
#         print("выход")
#         break
#     else:
#         print("завершон")












































































































































































