#  Set  это множество элементов которые нам помогает проверять
# не показывать похожие или один и тот же элемент

# numbers = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
# print(numbers)

# numbers = [1,3,5,4,2,6,1,3,5,24,6,3,]
# a = set(numbers)
# print(a)

# """
# задание
# Уникальные числа создать программу которая принемает числа
# от пользователя и сохроняет числа уникальные значение с
# помощью множество сет
# если пользователь введет стоп тогда перестать доавление
# используйте  add для добавление списка множество
# """
# numbers = ("Эрлан","Дастан","Абай","Адилет")
# a = set(numbers)
# while True:



































